; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	Star3 - direction
	Star5 - direction
	Star6 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star6)
	(supports instrument4 thermograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(have_image Phenomenon7 spectrograph0)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 spectrograph0)
	(have_image Star10 thermograph1)
	(have_image Star11 spectrograph0)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Star16 spectrograph0)
	(have_image Star17 spectrograph0)
	(have_image Star18 thermograph1)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
2. (calibrate satellite2 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 12
3. (turn_to satellite2 planet15 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet15)
   goals met: 0 of 12
4. (take_image satellite2 planet15 instrument3 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 1 of 12
5. (turn_to satellite2 phenomenon8 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 12
6. (take_image satellite2 phenomenon8 instrument3 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 2 of 12
7. (turn_to satellite2 phenomenon7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 12
8. (take_image satellite2 phenomenon7 instrument3 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 3 of 12
9. (turn_to satellite2 phenomenon14 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 12
10. (take_image satellite2 phenomenon14 instrument3 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 4 of 12
11. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 4 of 12
12. (take_image satellite2 phenomenon13 instrument3 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 5 of 12
13. (turn_to satellite2 planet9 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet9)
   goals met: 5 of 12
14. (take_image satellite2 planet9 instrument3 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 6 of 12
15. (turn_to satellite2 star10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star10)
   goals met: 6 of 12
16. (take_image satellite2 star10 instrument3 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 7 of 12
17. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 7 of 12
18. (take_image satellite2 star11 instrument3 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 8 of 12
19. (turn_to satellite2 star12 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star12)
   goals met: 8 of 12
20. (take_image satellite2 star12 instrument3 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 9 of 12
21. (turn_to satellite2 star16 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star16)
   goals met: 9 of 12
22. (take_image satellite2 star16 instrument3 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 10 of 12
23. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 10 of 12
24. (take_image satellite2 star17 instrument3 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 11 of 12
25. (turn_to satellite2 star18 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star18)
   goals met: 11 of 12
26. (take_image satellite2 star18 instrument3 thermograph1)
   added: (have_image star18 thermograph1)
   goals met: 12 of 12
